*>COBOL Grade Calculator



Identification Division.
Program-id. GradeCalc. 
Data Division. 
File Section. 

Working-Storage Section. 
*> These calculations and variables are for Multivariate Analysis. 
01 FinalGrade PIC 99V99.
01 WebWork PIC 99V99.
01 Paper PIC 99V99.
01 Quizzes.
	03 HighestQuiz PIC 99V99.
	03 SecondQuiz PIC 99V99.

01 TwoHighExams.
	03 HighestExam PIC 99V99.
	03 SecondExam PIC 99V99.

01 LowExam PIC 99.
01 FinalExam PIC 99. 

01 Weight1 PIC 99V99 VALUE 00.08. 
01 Weight2 PIC 99V99 VALUE 00.04. 
01 Weight3 PIC 99V99 VALUE 00.40.
01 Weight4 PIC 99V99 VALUE 00.10.
01 Weight5 PIC 99V99 VALUE 00.30.

01 QUIZGRADE PIC 999V9999. 
01 HIGHEXAMSGRADE PIC 999V9999.

Procedure Division. 
INIT-USER-INPUT.
	DISPLAY "Please note, enter all grades out of 100."
	DISPLAY "Enter Webwork Grade: ".
	ACCEPT WEBWORK.
	DISPLAY "Enter Paper Homework Grade: ".
	ACCEPT PAPER.
	DISPLAY "Enter your Highest Quiz Grade: ".
	ACCEPT HIGHESTQUIZ.
	DISPLAY "Enter your Second-Highest Quiz Grade: ".
	ACCEPT SECONDQUIZ.
	DISPLAY "Enter your lowest exam grade: ".
	ACCEPT LOWEXAM.
	DISPLAY "Enter your highest exam grade: ".
	ACCEPT HIGHESTEXAM.
	DISPLAY "Enter your second-highest exam grade: ".
	ACCEPT SECONDEXAM.
END-INIT-USER-INPUT. 

ADD HIGHESTQUIZ TO SECONDQUIZ GIVING QUIZGRADE.
DISPLAY "DEBUGGING LINE. THIS IS QUIZGRADE BEFORE DIVISION." QUIZGRADE.
DIVIDE 200 INTO QUIZGRADE. 
MULTIPLY 100 BY QUIZGRADE.
DISPLAY "HERE'S AFTER: " QUIZGRADE.

*> The above statement divides quizgrade by 200, and stores result in quizgrade

ADD HIGHESTEXAM TO SECONDEXAM GIVING HIGHEXAMSGRADE.
DISPLAY "DEBUGGING LINE. THIS IS HIGHEXAMSGRADE BEFORE DIVISION." HIGHEXAMSGRADE.
DIVIDE 200 INTO HIGHEXAMSGRADE. 
MULTIPLY 100 BY HIGHEXAMSGRADE.
DISPLAY "HERE'S AFTER: " HIGHEXAMSGRADE.

DISPLAY "Calculating...".

APPLYING-WEIGHTS.

	MULTIPLY WEIGHT1 BY WEBWORK.
	*>The above statement stores the result in WEBWORK.
	MULTIPLY WEIGHT1 BY PAPER.
	MULTIPLY WEIGHT2 BY QUIZGRADE.
	MULTIPLY WEIGHT3 BY HIGHEXAMSGRADE.
	MULTIPLY WEIGHT4 BY LOWEXAM.

END-APPLYING-WEIGHTS.

DISPLAY "A ZERO ON THE FINAL EXAM RESULTS IN THIS FINALGRADE: ".

ADD WEBWORK PAPER QUIZGRADE HIGHEXAMSGRADE LOWEXAM GIVING FINALGRADE. 
DISPLAY FINALGRADE.

DISPLAY "A 100 ON THE FINAL EXAM RESULTS IN THIS FINALGRADE: ".
MOVE 100 TO FINALEXAM. 
MULTIPLY WEIGHT5 BY FINALEXAM. 

ADD WEBWORK PAPER QUIZGRADE HIGHEXAMSGRADE LOWEXAM TO FINALEXAM GIVING FINALGRADE. 
DISPLAY FINALGRADE.

DISPLAY "Enter what grade you think you'll get on the finalexam: ".
ACCEPT FINALEXAM. 
MULTIPLY WEIGHT5 BY FINALEXAM. 

ADD WEBWORK PAPER QUIZGRADE HIGHEXAMSGRADE LOWEXAM TO FINALEXAM GIVING FINALGRADE. 

DISPLAY "That grade will give you this final grade in the course: ".
DISPLAY FINALGRADE.

DISPLAY "The following is for debugging.".
DISPLAY "webwork: " WEBWORK.
DISPLAY "paper: " PAPER.
DISPLAY "quizgrade: " QUIZGRADE.
DISPLAY "highexamsgrade: " HIGHEXAMSGRADE.
DISPLAY "lowexam: " LOWEXAM.
DISPLAY "finalexam: " FINALEXAM.
DISPLAY "finalgrade: " FINALGRADE. 


STOP RUN. 